/* Составить расписание на неделю: пользователь вводит порядковый номер дня недели и у него на экране отображается, то, что запланировано на этот день. */

#include <iostream>

using namespace std;

int main() {
	system("chcp 1251");
	system("cls");
	setlocale(0, "");

	int day_number;
	cout << "Введите день недели: "; cin >> day_number;

	switch (day_number) {
	case 1:
		cout << "\tПонедельник" << '\n';
		cout << "8:00 - 9:35 --> ОиФЭВМиПУ (ЛК)" << '\n';
		cout << "9:55 - 11:30 --> Физра (ПЗ)" << '\n';
		cout << "11:40 - 13:15 --> ЛАиАГ (ЛК)" << '\n';
		break;
	case 2:
		cout << "\tВторник" << '\n';
		cout << "8:00 - 9:35 --> ИГ (ЛК)" << '\n';
		cout << "9:55 - 11:30 --> ЛАиАГ (ПЗ)" << '\n';
		cout << "11:40 - 13:15 --> МА (ЛК)" << '\n';
		break;
	case 3:
		cout << "\tСреда" << '\n';
		cout << "8:00 - 9:35 --> ИЧ" << '\n';
		cout << "9:55 - 11:30 --> ОАиП (ЛК)" << '\n';
		cout << "11:40 - 13:15 --> Англ (ПЗ)" << '\n';
		break;
	case 4:
		cout << "\tЧетверг" << '\n';
		cout << "8:00 - 9:35 --> занятия нет" << '\n';
		cout << "9:55 - 11:30 --> Физра (ПЗ)" << '\n';
		cout << "11:40 - 13:15 --> ИГ (ПЗ)" << '\n';
		cout << "13:55 - 15:30 --> ОАиП (ЛР)" << '\n';
		break;
	case 5:
		cout << "\tПятница" << '\n';
		cout << "8:00 - 9:35 --> ДМ (ЛК)" << '\n';
		cout << "9:55 - 11:30 --> История (ЛК)" << '\n';
		cout << "11:40 - 13:15 --> История (ПЗ)" << '\n';
		break;
	case 6:
		cout << "\tСуббота" << '\n';
		cout << "8:00 - 9:35 --> ВРПО (ЛК)" << '\n';
		cout << "9:55 - 11:30 --> МА (ЛК)" << '\n';
		cout << "11:40 - 13:15 --> ВРПО (ЛР)" << '\n';
		break;
	case 7:
		cout << "\tВоскресенье" << '\n';
		cout << "Сегодня нет занятий. Отдыхайте" << '\n';
		break;
	}

	system("pause");
	return 0;
}

